/* eslint no-useless-escape: 0 */
export default {
    langCN: /^[\u4e00-\u9fa5]$/,
    langEN: /[a-zA-Z]/,
    mobile: /^[1][345789][0-9]{9}$/,
    // 6至20位，以字母开头，字母，数字，减号，下划线
    password: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})$/,
    // 强密码正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
    xpassword: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
    email: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,
    // 无牌车识别码（纯数字，4-6位）
    rectCode: /^\d{4,6}$/,
    /**
     * 支持普通7位车牌：闽D12E34, 闽D1234挂
     * 支持8位新能源车牌：闽DD12345, 闽D12345F
     */
    plate: /^[冀豫云辽黑湘皖鲁苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼渝京津沪新军空海北沈兰济南广成使领A-Z][A-Z]([A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1}|[DF][A-HJ-NP-Z0-9][0-9]{4}|[0-9]{5}[DF])$/i,
};
